
if($SwitchView.isSP()){
	//======================================================
	// SP判定の場合
	//======================================================
	//ビジュアルバナー画像
	$.resource.set({
		top_visual: '<img src="../common/img_20150623/sp/domestic/img_main2.jpg" alt="「国内旅行の保険」" style="width:100%;" />'}
	);
	
}else{
	//======================================================
	// PC判定の場合
	//======================================================
	//ビジュアルバナー画像
	$.resource.set({
		top_visual: '<img src="../common/img_20150623/pc/domestic/img_main2.jpg" width="980" height="287" alt="「国内旅行の保険」" />'}
	);
}