if($SwitchView.isSP()){
	//======================================================
	// SP判定の場合
	//======================================================
	//ビジュアルバナー画像
	$.resource.set({
		top_visual: '<img src="../common/img_20150623/sp/oversea/img_main2.jpg" alt="あうて「旅行の保険 海外旅行」" />'}
	);
	
}else{
	//======================================================
	// PC判定の場合
	//======================================================
	//ビジュアルバナー画像
	$.resource.set({
		top_visual: '<img src="../common/img_20150623/pc/oversea/img_main1.jpg" style="width:100%;max-width:980px;" alt="あうて「旅行の保険 海外旅行」" />'}
	);
}
