if($SwitchView.isSP()){
	//======================================================
	// SP判定の場合
	//======================================================
	//ビジュアルバナー画像
	$.resource.set({
		top_visual: '<img src="../common/img_20150623/sp/golf/img_main2.jpg" alt="「ゴルフの保険」"  style="width:100%;" />'}
	);
	
}else{
	//======================================================
	// PC判定の場合
	//======================================================
	//ビジュアルバナー画像
	$.resource.set({
		top_visual: '<img src="../common/img_20150623/pc/golf/img_main2.jpg"  width="980" height="287" alt="「ゴルフの保険」" />'}
	);
}
