if($SwitchView.isSP()){
	//======================================================
	// SP判定の場合
	//======================================================
	//ビジュアルバナー画像
	$.resource.set({'slider_visual': 
		'<img src="./common/img_20150623/pc/top/img_main_sp.jpg" alt="「あ・う・て」はau損保の保険商品ブランドです。" />'}
	);
	
}else{
	//======================================================
	// PC判定の場合
	//======================================================
	//ビジュアルバナー画像
	$.resource.set({'slider_visual': 
		'<img src="./common/img_20150623/pc/top/img_main_pc.jpg"  width="800" height="350" alt="「あ・う・て」はau損保の保険商品ブランドです。" />'}
	);
}