if($SwitchView.isSP()){
	//======================================================
	// SP判定の場合
	//======================================================
	//ビジュアルバナー画像
	$.resource.set({
		top_visual: '<img src="../common/img_20150623/sp/daily/img_main2.jpg" alt="「ケガの保険 日常の事故」" style="width:100%;"  />'}
	);
	
}else{
	//======================================================
	// PC判定の場合
	//======================================================
	//ビジュアルバナー画像
	$.resource.set({
		top_visual: '<img src="../common/img_20150623/pc/daily/img_main2.jpg" width="980" height="287"  alt="「ケガの保険 日常の事故」" />'}
	);
}
